360/3lab360/myPerf/3trial/10thread/100_requests_1_concurrent_mediumHTML.txt
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking janice.cs.byu.edu (be patient).....done


Server Software:        
Server Hostname:        janice.cs.byu.edu
Server Port:            3060

Document Path:          /medium.html
Document Length:        1517079 bytes

Concurrency Level:      1
Time taken for tests:   1.630 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      151714800 bytes
HTML transferred:       151707900 bytes
Requests per second:    61.35 [#/sec] (mean)
Time per request:       16.300 [ms] (mean)
Time per request:       16.300 [ms] (mean, across all concurrent requests)
Transfer rate:          90897.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      1       1
Processing:    14   16   2.3     15      23
Waiting:        0    1   0.1      1       1
Total:         14   16   2.3     16      24
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     16
  75%     17
  80%     18
  90%     20
  95%     21
  98%     23
  99%     24
 100%     24 (longest request)